
#Область ПрограммныйИнтерфейс

Процедура СоздатьБазуДанныхAccess(Знач ИмяФайла, Знач ПерезаписыватьФайл = Истина) Экспорт

	Если ПустаяСтрока(ИмяФайла) Тогда 
		ВызватьИсключение "Не задан путь к файлу базы!";
	Иначе
		Если ПерезаписыватьФайл Тогда
			Файл = Новый Файл(ИмяФайла);
			Если Файл.Существует() Тогда
				Файл = Неопределено;
				УдалитьФайлы(ИмяФайла);
			КонецЕсли;
		КонецЕсли;              
	КонецЕсли;
	
	Попытка
		АДОХ = Новый COMОбъект("ADOX.Catalog");
	Исключение
		ВызватьИсключение 
			"Не удалось сформировать файл с данными. 
			|При создании объекта ADOX.Catalog произошла ошибка!
			|" + ОписаниеОшибки();
	КонецПопытки;
	
	СтрокаПодключения = "Provider=Microsoft.Jet.OLEDB.4.0;Data Source=""" + ИмяФайла + """;Jet OLEDB:Engine Type=5;"; 
	
	Попытка
		АДОХ.Create(СтрокаПодключения);
	Исключение
		ВызватьИсключение 
			"Не удалось сформировать файл с данными. 
			|При создании объекта ADOX.Catalog произошла ошибка!
			|" + ОписаниеОшибки();
	КонецПопытки;
	АДОХ.ActiveConnection.Close();
	АДОХ = Неопределено;
	
КонецПроцедуры

Процедура СоздатьТаблицуБазыAccess(ПутьКФайлу, ОписаниеСтруктурыТаблицы)
	
	СоздатьБазуДанныхAccess(ПутьКФайлу);
	
	СтрокаПодключения = "Provider=Microsoft.Jet.OLEDB.4.0;Data Source=" + ПутьКФайлу;
	Catalog = Новый COMОбъект("ADOX.Catalog");
	Catalog.ActiveConnection = СтрокаПодключения;
	
	Table = Новый COMОбъект("ADOX.Table");
	Table.Name = ОписаниеСтруктурыТаблицы.ИмяТаблицы;
	
	Для Каждого ОписаниеПоля Из ОписаниеСтруктурыТаблицы.ОписаниеПолей Цикл
		
		Column = Новый COMОбъект("ADOX.Column");
		Column.Name = ОписаниеПоля.Имя;	
		Column.Type = ОписаниеПоля.Тип;
		
		Если ОписаниеПоля.ТипЗначения = Тип("Число") Тогда
			Если ЗначениеЗаполнено(ОписаниеПоля.Длина) Тогда
				Column.NumericScale = ОписаниеПоля.Длина;
			КонецЕсли;		
			Если ЗначениеЗаполнено(ОписаниеПоля.ДлинаДробнойЧасти) Тогда
				Column.Precision = ОписаниеПоля.ДлинаДробнойЧасти;
			КонецЕсли;
			Column.Attributes = 2; // Доступно значение NULL
		ИначеЕсли ОписаниеПоля.ТипЗначения = Тип("Строка") Тогда
			Если ЗначениеЗаполнено(ОписаниеПоля.Длина) Тогда
				Column.DefinedSize = ОписаниеПоля.Длина;				
			КонецЕсли;			
			Column.Attributes = 2; // Доступно значение NULL
		ИначеЕсли ОписаниеПоля.ТипЗначения = Тип("Дата") Тогда
			Column.Attributes = 2; // Доступно значение NULL
		КонецЕсли;
		
		Table.Columns.Append(Column);
		
	КонецЦикла;
	
	Catalog.Tables.Append(Table);
		
КонецПроцедуры

#КонецОбласти