
&НаСервере
Функция ВыгрузитьВAccessНаСервере()
	
	ОтчетНаСервере = РеквизитФормыВЗначение("Отчет");
	
	РезультатВыгрузки = РаботаСAccessСервер.ВыгрузитьРезультатКомпоновки(
		ОтчетНаСервере.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"),
		Отчет.КомпоновщикНастроек.ПолучитьНастройки(),
		СтрЗаменить(ЭтаФорма.ПредставлениеТекущегоВарианта, " ", "_"));

	Возврат РезультатВыгрузки;
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьВAccess(Команда)
	
	Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = НСтр("ru = 'Архив баз'; en = 'Archive of databases'")
	+ "(*.zip)|*.zip";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Сохранение архива с базами";
	ДиалогОткрытияФайла.ПолноеИмяФайла = "ТестоваяВыгрузка.zip";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		
		РезультатВыгрузки = ВыгрузитьВAccessНаСервере();
		
		ДанныеФайла = РезультатВыгрузки.АрхивВыгрузки;
		ДанныеФайла.Записать(ДиалогОткрытияФайла.ПолноеИмяФайла);
	Иначе
		Предупреждение(НСтр("ru = 'Файл(ы) не выбран!'; en = 'File(s) not selected!'"));
	КонецЕсли;
	
КонецПроцедуры
