
&НаСервере
Функция ВыгрузитьВAccessНаСервере()
	
	ОтчетНаСервере = РеквизитФормыВЗначение("Отчет");
	
	КаталогВыгрузки = КаталогВременныхФайлов() + "ВыгрузкаИзСКДвAccess";
	СоздатьКаталог(КаталогВыгрузки);
	
	РезультатВыгрузки = РаботаСAccessСервер.ВыгрузитьРезультатКомпоновки(
		КаталогВыгрузки,
		ОтчетНаСервере.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"),
		Отчет.КомпоновщикНастроек.ПолучитьНастройки(),
		СтрЗаменить(ЭтаФорма.ПредставлениеТекущегоВарианта, " ", "_"),
		РаботаСAccessКлиентСервер.ПолучитьОграниченияВыгрузкиБазы(,2,)
	);

	ИмяТаблицы = "ВыгрузкаОтчетаСКД";
	Коллекциябаз = НайтиФайлы(КаталогВыгрузки, "*.accdb");
	ПутьКАрхиву = КаталогВыгрузки + "\" + Формат(ТекущаяДата(), "ДФ=yyyyMMdd") + "_ВыгрузкаДанных_" + ИмяТаблицы + ".zip";
	Архив = Новый ЗаписьZipФайла(ПутьКАрхиву,, "Выгрузка данных в Access """ + ИмяТаблицы + """");
	Для Каждого ФайлБазы Из Коллекциябаз Цикл
		Архив.Добавить(ФайлБазы.ПолноеИмя, РежимСохраненияПутейZIP.НеСохранятьПути);
	КонецЦикла;
	Архив.Записать();		
		
	Возврат Новый ДвоичныеДанные(ПутьКАрхиву);
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьВAccess(Команда)
	
	Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = НСтр("ru = 'Архив баз'; en = 'Archive of databases'")
	+ "(*.zip)|*.zip";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Сохранение архива с базами";
	ДиалогОткрытияФайла.ПолноеИмяФайла = "ВыгрузкаОтчетаСКД.zip";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		
		ДанныеФайла = ВыгрузитьВAccessНаСервере();
		ДанныеФайла.Записать(ДиалогОткрытияФайла.ПолноеИмяФайла);
	Иначе
		Предупреждение(НСтр("ru = 'Файл(ы) не выбран!'; en = 'File(s) not selected!'"));
	КонецЕсли;
	
КонецПроцедуры
