
&НаКлиенте
Процедура СоздатьПисьмо(Команда)
	
	РаботаСOutlookКлиент.СоздатьПисьмо(
		"Привет из 1С!",
		"Добрый день!
		|
		|Вы уже смотрели новую версию платформы 1С?",
		"ivanovii@server.ru");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСобытие(Команда)
	
	РаботаСOutlookКлиент.СоздатьСобытие(
		"Событие из 1С!",
		НачалоДня(ТекущаяДата()),
		КонецДня(ТекущаяДата()),
		"Суть события - ничего не произойдет!");		
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗадачу(Команда)
	
	РаботаСOutlookКлиент.СоздатьЗадачу(
		"Задача из 1С!",
		НачалоДня(ТекущаяДата()),
		"Ничего не делайте!");		
	
КонецПроцедуры
