
#Область ОбработчикиКоманд

&НаКлиенте
Процедура ВыгрузкаВТаблицуЗначений(Команда)
	
	Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = НСтр("ru = 'Архив с базами'; en = 'Acrchive with databases'")
	+ "(*.zip)|*.zip";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Сохранение базы";
	ДиалогОткрытияФайла.ПолноеИмяФайла = "ВыгрузкаТаблицыЗначений.zip";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		ДанныеФайла = ВыгрузкаВТаблицуЗначенийНаСервере();
		ДанныеФайла.Записать(ДиалогОткрытияФайла.ПолноеИмяФайла);
	Иначе
		Предупреждение(НСтр("ru = 'Файл(ы) не выбран!'; en = 'File(s) not selected!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЗапрос(Команда)
	
	Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = НСтр("ru = 'Архив с базами'; en = 'Acrchive with databases'")
	+ "(*.zip)|*.zip";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Сохранение базы";
	ДиалогОткрытияФайла.ПолноеИмяФайла = "ВыгрузкаЗапроса.zip";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		ДанныеФайла = ВыгрузитьЗапросНаСервере();
		ДанныеФайла.Записать(ДиалогОткрытияФайла.ПолноеИмяФайла);
	Иначе
		Предупреждение(НСтр("ru = 'Файл(ы) не выбран!'; en = 'File(s) not selected!'"));
	КонецЕсли;

	
КонецПроцедуры

#КонецОбласти

#Область Служебные

&НаСервере
Функция ВыгрузкаВТаблицуЗначенийНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Значения_1.ПолеЧисло КАК ПолеЧисло,
		|	Значения_1.ПолеСтрока КАК ПолеСтрока,
		|	ИСТИНА КАК Булево,
		|	ДАТАВРЕМЯ(2018, 12, 31) КАК Дата
		|ПОМЕСТИТЬ Значения_1
		|ИЗ
		|	(ВЫБРАТЬ
		|		1 КАК ПолеЧисло,
		|		""Тест 1"" КАК ПолеСтрока
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		2,
		|		""Тест 2""
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		3,
		|		""Тест 3"") КАК Значения_1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Значения_2.ПолеЧисло КАК ПолеЧисло,
		|	Значения_2.ПолеСтрока КАК ПолеСтрока,
		|	ЛОЖЬ КАК Булево,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК Дата
		|ПОМЕСТИТЬ Значения_2
		|ИЗ
		|	(ВЫБРАТЬ
		|		1 КАК ПолеЧисло,
		|		""Тест 1"" КАК ПолеСтрока
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		2,
		|		""Тест 2""
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		3,
		|		""Тест 3"") КАК Значения_2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Значения_1.ПолеСтрока КАК FieldTwo,
		|	Значения_2.ПолеСтрока КАК FieldFour,
		|	Значения_1.Булево КАК BoolT,
		|	Значения_2.Булево КАК BoolF,
		|	Значения_1.Дата КАК DateNormal,
		|	Значения_2.Дата КАК DateEmpty,
		|	ДАТАВРЕМЯ(1753, 1, 1) КАК DateTooSmall,
		|	ДАТАВРЕМЯ(100, 1, 1) КАК DateError,
		|	ДАТАВРЕМЯ(3999, 12, 31) КАК DateTooBig,
		|	ВЫРАЗИТЬ(1 КАК ЧИСЛО(5, 0)) КАК SimpleNumber,
		|	1923.55 + 65.04 КАК ComplexNumber,
		|	""You can actually use the Decimal data type in CREATE TABLE queries. However, this requires your statement to be executed either using ADO, or on a database that's been set to use ANSI-92 compatible syntax. To set your database to ANSI-92 compatible syntax: Go to File -> Options. Open the tab Object Designers. Go to Query Designer, and under SQL Server Compatible Syntax (ANSI 92), check This Database. Now you can just execute the query. Note that this affects all queries in the database, and affects queries in various ways. To execute a query using ADO:"" КАК LongString
		|ИЗ
		|	Значения_1 КАК Значения_1,
		|	Значения_2 КАК Значения_2";
	
	ТаблицаВыгрузки = Запрос.Выполнить().Выгрузить();
	
	КаталогВыгрузки = КаталогВременныхФайлов() + "ТестоваяВыгрузка";
	СоздатьКаталог(КаталогВыгрузки);
	
	РезультатВыгрузки = 
		РаботаСAccessСервер.ВыгрузитьТаблицуЗначений(
			КаталогВыгрузки, 
			ТаблицаВыгрузки,
			,
			РаботаСAccessКлиентСервер.ПолучитьОграниченияВыгрузкиБазы(,3));
		
	ИмяТаблицы = "ВыгрузкаТаблицыЗначений";
	Коллекциябаз = НайтиФайлы(КаталогВыгрузки, "*.accdb");
	ПутьКАрхиву = КаталогВыгрузки + "\" + Формат(ТекущаяДата(), "ДФ=yyyyMMdd") + "_ВыгрузкаДанных_" + ИмяТаблицы + ".zip";
	Архив = Новый ЗаписьZipФайла(ПутьКАрхиву,, "Выгрузка данных в Access """ + ИмяТаблицы + """");
	Для Каждого ФайлБазы Из Коллекциябаз Цикл
		Архив.Добавить(ФайлБазы.ПолноеИмя, РежимСохраненияПутейZIP.НеСохранятьПути);
	КонецЦикла;
	Архив.Записать();		
		
	Возврат Новый ДвоичныеДанные(ПутьКАрхиву); 
	
КонецФункции

&НаСервере
Функция ВыгрузитьЗапросНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Значения_1.ПолеЧисло КАК ПолеЧисло,
		|	Значения_1.ПолеСтрока КАК ПолеСтрока,
		|	ИСТИНА КАК Булево,
		|	ДАТАВРЕМЯ(2018, 12, 31) КАК Дата
		|ПОМЕСТИТЬ Значения_1
		|ИЗ
		|	(ВЫБРАТЬ
		|		1 КАК ПолеЧисло,
		|		""Тест 1"" КАК ПолеСтрока
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		2,
		|		""Тест 2""
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		3,
		|		""Тест 3"") КАК Значения_1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Значения_2.ПолеЧисло КАК ПолеЧисло,
		|	Значения_2.ПолеСтрока КАК ПолеСтрока,
		|	ЛОЖЬ КАК Булево,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК Дата
		|ПОМЕСТИТЬ Значения_2
		|ИЗ
		|	(ВЫБРАТЬ
		|		1 КАК ПолеЧисло,
		|		""Тест 1"" КАК ПолеСтрока
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		2,
		|		""Тест 2""
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		3,
		|		""Тест 3"") КАК Значения_2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Значения_1.ПолеСтрока КАК FieldTwo,
		|	Значения_2.ПолеСтрока КАК FieldFour,
		|	Значения_1.Булево КАК BoolT,
		|	Значения_2.Булево КАК BoolF,
		|	Значения_1.Дата КАК DateNormal,
		|	Значения_2.Дата КАК DateEmpty,
		|	ДАТАВРЕМЯ(1753, 1, 1) КАК DateTooSmall,
		|	ДАТАВРЕМЯ(100, 1, 1) КАК DateError,
		|	ДАТАВРЕМЯ(3999, 12, 31) КАК DateTooBig,
		|	ВЫРАЗИТЬ(1 КАК ЧИСЛО(5, 0)) КАК SimpleNumber,
		|	1923.55 + 65.04 КАК ComplexNumber,
		|	""You can actually use the Decimal data type in CREATE TABLE queries. However, this requires your statement to be executed either using ADO, or on a database that's been set to use ANSI-92 compatible syntax. To set your database to ANSI-92 compatible syntax: Go to File -> Options. Open the tab Object Designers. Go to Query Designer, and under SQL Server Compatible Syntax (ANSI 92), check This Database. Now you can just execute the query. Note that this affects all queries in the database, and affects queries in various ways. To execute a query using ADO:"" КАК LongString
		|ИЗ
		|	Значения_1 КАК Значения_1,
		|	Значения_2 КАК Значения_2";
		
	КаталогВыгрузки = КаталогВременныхФайлов() + "ТестоваяВыгрузка";
	СоздатьКаталог(КаталогВыгрузки);
	
	РезультатВыгрузки = 
		РаботаСAccessСервер.ВыгрузитьЗапрос(
			КаталогВыгрузки, 
			Запрос,
			,
			РаботаСAccessКлиентСервер.ПолучитьОграниченияВыгрузкиБазы(,3));
		
	ИмяТаблицы = "ВыгрузкаТаблицыЗначений";
	Коллекциябаз = НайтиФайлы(КаталогВыгрузки, "*.accdb");
	ПутьКАрхиву = КаталогВыгрузки + "\" + Формат(ТекущаяДата(), "ДФ=yyyyMMdd") + "_ВыгрузкаДанных_" + ИмяТаблицы + ".zip";
	Архив = Новый ЗаписьZipФайла(ПутьКАрхиву,, "Выгрузка данных в Access """ + ИмяТаблицы + """");
	Для Каждого ФайлБазы Из Коллекциябаз Цикл
		Архив.Добавить(ФайлБазы.ПолноеИмя, РежимСохраненияПутейZIP.НеСохранятьПути);
	КонецЦикла;
	Архив.Записать();		
		
	Возврат Новый ДвоичныеДанные(ПутьКАрхиву); 
	
КонецФункции

#КонецОбласти