
#Область ПрограммныйИнтерфейс

Функция ПолучитьДлинуПредставленияСсылочнгоТипа(ТипСсылки) Экспорт
	
	ДлинаПредставленияСсылки = 0;
	МетаданныеПоТипу = Метаданные.НайтиПоТипу(ТипСсылки);
	Если Метаданные.Перечисления.Содержит(МетаданныеПоТипу) Тогда
		
		ЗначенияПеречисления = МетаданныеПоТипу.ЗначенияПеречисления;	
		Для Каждого ЗначениеПеречисления Из ЗначенияПеречисления Цикл
			
			ДлинаПредставленияСсылки = Макс(ДлинаПредставленияСсылки, СтрДлина(ЗначениеПеречисления.Синоним));
			
		КонецЦикла;
		
	КонецЕсли;

	Возврат ДлинаПредставленияСсылки;
	
КонецФункции

Функция ПолучитьДвоичныеДанныеПустойБазыAccess() Экспорт
	
	Возврат ПолучитьОбщийМакет("ШаблонПустойБазыAccess");
	
КонецФункции

#КонецОбласти